using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Matrix.SurveyServer.Driver.Im2300N_Stel
{
    public partial class Driver
    {
        /// <summary>
        /// обращаем внимание на расчетный час, называем его строго так
        /// </summary>
        /// <param name="task"></param>
        /// <returns></returns>
        private IDictionary<int, string> GetTaskMap(int task)
        {
            switch (task)
            {
                case 0001:
                    return new Dictionary<int, string>()
					{
						{ 9,"Qt(Gm1;2)-расч. по прямой(0)/обр.(1)"},
						{ 5,"Тхв - температура холодной воды"}
					};
                case 0002:
                    return new Dictionary<int, string>()
                    {

                    };
                case 0003:
                    return new Dictionary<int, string>()
                    {

                    };
                case 0005:
                    return new Dictionary<int, string>()
					{
						{5,"Тхв - температура холодной воды"}
					};
                case 0009:
                    return new Dictionary<int, string>()
					{
						{12,"Pбар - давление барометрическое,мм р"},
						{5,"tхв - температура холодной воды"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"}
					};
                case 0011:
                    return new Dictionary<int, string>()
					{
						{5,"Tхв - температура холодной воды"}
					};
                case 0012:
                    return new Dictionary<int, string>()
					{
						{5,"Tхв - температура холодной воды"},
						{1,"Вариант расчета задачи"}
					};
                case 0013:
                    return new Dictionary<int, string>()
					{
						{ 9,"Qt(Gm1;2) - расчет по прямой - 0,по обратке - 1"}
					};
                case 0015:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.,кг/м³"},
						{7,"fi - относительная влажность,%"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"NN₂ - содержание азота, %"},
						{5,"NCO₂ - содержание углек.газа,%"},
						{29,"Сероводород (H₂S)"},
						{9,"(0-природный)"},
						{13,"Тimp - длит.имп.переключения,сек"},
						{14,"Тswitch - время переключ.скважины,мин"},
						{15,"Тwait - время ожидания имп.расхода,мин"},
						{16,"Тwork - время работы в автом.режиме,час"},
						{45,"Тimp - длит.имп.переключения,сек"},
						{46,"Тswitch - время переключ.скважины,мин"},
						{47,"Тwait - время ожидания имп.расхода,мин"},
						{48,"Тwork - время работы в автом.режиме,час"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,1)"},
						{63,"Q(4,1)"}
					};
                case 0017:
                    return new Dictionary<int, string>()
					{
						{5,"Tхв - температура холодной воды"},
						{9,"Qt(Gm1,2)-расч. по прямой(0)/обр.(1)"}
					};
                case 0022:
                    return new Dictionary<int, string>()
					{
						{ 4,"Ron - плотн.при норм.усл.,кг/м³"},
						{45,"tnor - нормальная температура"},
						{29,"С1 - коэффициент полинома"},
						{30,"С2 - коэффициент полинома"},
						{31,"C₃ - коэффициент полинома"},
						{32,"С4 - коэффициент полинома"},
						{33,"С5 - коэффициент полинома"},
						{14,"Метод обработки (1- кус.ломаная)"},
						{15,"Число точек обработки (Nmax = 10)"},
						{16,"Fmin - минимальная частота, Гц"},
						{17,"Интервал между точками, Гц"},
						{18,"Поправочный коэффициент в точке 1"},
						{19,"Поправочный коэффициент в точке 2"},
						{20,"Поправочный коэффициент в точке 3"},
						{21,"Поправочный коэффициент в точке 4"},
						{22,"Поправочный коэффициент в точке 5"},
						{23,"Поправочный коэффициент в точке 6"},
						{24,"Поправочный коэффициент в точке 7"},
						{25,"Поправочный коэффициент в точке 8"},
						{26,"Поправочный коэффициент в точке 9"},
						{27,"Поправочный коэффициент в точке 10"},
						{28,"Поправочный коэффициент в точке 11"}
					};
                case 0023:
                    return new Dictionary<int, string>()
					{
						{ 5,"Tхв - температура холодной воды"}
					};
                case 0024:
                    return new Dictionary<int, string>()
					{
						{ 9,"Qt(Gm1;2)-расч. по прямой(0)/обр(1)"},
						{ 5,"Тхв - температура холодной воды"}
					};
                case 0025:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.,кг/м³"},
						{45,"tnor - нормальная температура"},
						{33,"С1 - коэффициент полинома"},
						{34,"С2 - коэффициент полинома"},
						{35,"C₃ - коэффициент полинома"},
						{36,"С4 - коэффициент полинома"},
						{37,"С5 - коэффициент полинома"},
						{18,"Метод обработки (1- кус.ломаная)"},
						{19,"Число точек обработки (Nmax = 10)"},
						{20,"Fmin - минимальная частота, Гц"},
						{21,"Интервал между точками, Гц"},
						{22,"Поправочный коэффициент в точке 1"},
						{23,"Поправочный коэффициент в точке 2"},
						{24,"Поправочный коэффициент в точке 3"},
						{25,"Поправочный коэффициент в точке 4"},
						{26,"Поправочный коэффициент в точке 5"},
						{27,"Поправочный коэффициент в точке 6"},
						{28,"Поправочный коэффициент в точке 7"},
						{29,"Поправочный коэффициент в точке 8"},
						{30,"Поправочный коэффициент в точке 9"},
						{31,"Поправочный коэффициент в точке 10"},
						{32,"Поправочный коэффициент в точке 11"}
					};
                case 0026:
                    return new Dictionary<int, string>()
					{
						{5,"Tхв - температура холодной воды"}
					};
                case 0027:
                    return new Dictionary<int, string>()
					{
						{9,"Qt(Gm1;2)-расч. по прямой(0)/обр.(1)"},
						{5,"Тхв - температура холодной воды"}
					};
                case 0029:
                    return new Dictionary<int, string>()
					{
						{ 4,"Ron - плотн.при норм.усл.,кг/м³"},
						{ 6,"NN₂ - содержание азота, %"},
						{ 5,"NCO₂ - содержание углек.газа,%"},
						{ 7,"fi - относительная влажность,%"},
						{ 9,"(0-природ,1-воздух,2-попут,3-кислор)"},
						{ 12,"Pбар - Барометр. давление, мм рт.ст."},
						{13,"tr - расчетный час"},
						{14,"Метод обработки (1- кус.ломаная)"},
						{15,"Число точек обработки (Nmax = 11)"},
						{16,"Fmin - минимальная частота, Гц"},
						{17,"Интервал между точками, Гц"},
						{18,"Поправочный коэффициент в точке 1"},
						{19,"Поправочный коэффициент в точке 2"},
						{20,"Поправочный коэффициент в точке 3"},
						{21,"Поправочный коэффициент в точке 4"},
						{22,"Поправочный коэффициент в точке 5"},
						{23,"Поправочный коэффициент в точке 6"},
						{24,"Поправочный коэффициент в точке 7"},
						{25,"Поправочный коэффициент в точке 8"},
						{26,"Поправочный коэффициент в точке 9"},
						{27,"Поправочный коэффициент в точке 10"},
						{28,"Поправочный коэффициент в точке 11"},
						{46,"Метод обработки (1- кус.ломаная)"},
						{47,"Число точек обработки (Nmax = 11)"},
						{48,"Fmin - минимальная частота, Гц"},
						{49,"Интервал между точками, Гц"},
						{50,"Поправочный коэффициент в точке 1"},
						{51,"Поправочный коэффициент в точке 2"},
						{52,"Поправочный коэффициент в точке 3"},
						{53,"Поправочный коэффициент в точке 4"},
						{54,"Поправочный коэффициент в точке 5"},
						{55,"Поправочный коэффициент в точке 6"},
						{56,"Поправочный коэффициент в точке 7"},
						{57,"Поправочный коэффициент в точке 8"},
						{58,"Поправочный коэффициент в точке 9"},
						{59,"Поправочный коэффициент в точке 10"},
						{60,"Поправочный коэффициент в точке 11"}
					};
                case 0030:
                    return new Dictionary<int, string>()
					{
						{12,"Pбар - давление барометр.,мм рт.ст."},
						{5,"tхв - температура холодной воды"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)."}
					};
                case 0031:
                    return new Dictionary<int, string>()
					{
						{ 4,"Ron - плотн. безвод. нефти (t=20 град).,т/.м³"},
						{ 5,"Fн - коэффициент сжимаемости нефти, 1/МПа"},
						{29,"F в- коэффициент сжимаемости воды, 1/МПа"},
						{6,"Vс - содержание солей в жидкости, %"},
						{7,"Vмех.пр. - содержание мех. примесей в жидкости, %"},
						{8,"Ксг - коэффициент содержания свободного. газа"},
						{9,"Крг - коэффициент содержания растворенного газа"},
						{3,"Квяз - коэффициент вязкости"},
						{10,"Кt н - коэффициент объемного расширения нефти"},
						{11,"Кt в - коэффициент объемного расширения воды"},
						{1,"tn - температура, °С"},
						{2,"Ризб - давление, МПа"},
						{30,"Wn - обводненность нефти,%"},
						{12,"Рбар - барометр. давление, мм.рт.ст."},
						{14,"М - метод обработки (1- кус.ломаная)"},
						{15,"N-1 - число точек обработки минус один,(Nmax = 11)"},
						{16,"Fmin - минимальная частота, Гц"},
						{17,"dF - шаг по частоте, Гц"},
						{18,"K1 - поправка при F = Fmin"},
						{19,"К2 - поправка при F = Fmin + dF"},
						{20,"К3 - поправка при F = Fmin + 2∙dF"},
						{21,"К4 - поправка при F = Fmin + 3∙ dF"},
						{22,"К5 - поправка при F = Fmin + 4∙dF"},
						{23,"К6 - поправка при F = Fmin + 5∙dF"},
						{24,"K7 - поправка при F = Fmin + 6∙dF"},
						{25,"К8 - поправка при F = Fmin + 7∙dF"},
						{26,"К9 - поправка при F = Fmin + 8∙ dF"},
						{27,"К10 - поправка при F = Fmin + 9∙dF"},
						{28,"К11 - поправка при F = Fmin + 10∙dF"}
					};
                case 0033:
                    return new Dictionary<int, string>()
					{
						{ 4,"Ro - плотность жидкости,кг/.м³"},
						{ 5,"G - ускорение свободного падения, м/ сек^2"},
						{6,"h0 - нулевой уровень, м"},
						{7,"S - площадь резервуара, м^2"}
					};
                case 0034:
                    return new Dictionary<int, string>()
					{
						{1,"tn - температура, °С"},
						{2,"Рir - давление, МПа"},
						{3,"Wn - обводненность нефти,%"},
						{4,"Ron - плотн. безвод. нефти (t=20 град).,т/.м³"},
						{5,"Квяз - коэффициент вязкости"},
						{6,"Vс - содержание солей в жидкости, %"},
						{7,"Vмех.пр. - содержание мех. примесей в жидкости, %"},
						{8,"Ксг - коэффициент содержания свободного. газа"},
						{9,"Крг - коэффициент содержания растворенного газа"},
						{10,"Кt н - коэффициент объемного расширения нефти"},
						{11,"Кt в - коэффициент объемного расширения воды"},
						{13,"F в- коэффициент сжимаемости воды, 1/МПа"},
						{14,"Fн - коэффициент сжимаемости нефти, 1/МПа"},
						{12,"Рбар - барометр. давление, мм.рт.ст."},
						{15,"Wt - порог переключ. влагомеров, %"},
						{18,"М - метод обработки (1- кус.ломаная)"},
						{19,"N-1 - число точек обраб. минус один,(Nmax = 11)"},
						{20,"Fmin - минимальная частота, Гц"},
						{21,"dF - шаг по частоте, Гц"},
						{22,"K1 - поправка при F = Fmin"},
						{23,"К2 - поправка при F = Fmin + dF"},
						{24,"К3 - поправка при F = Fmin + 2∙dF"},
						{25,"К4 - поправка при F = Fmin + 3∙ dF"},
						{26,"К5 - поправка при F = Fmin + 4∙dF"},
						{27,"К6 - поправка при F = Fmin + 5∙dF"},
						{28,"K7 - поправка при F = Fmin + 6∙dF"},
						{29,"К8 - поправка при F = Fmin + 7∙dF"},
						{30,"К9 - поправка при F = Fmin + 8∙ dF"},
						{31,"К10 - поправка при F = Fmin + 9∙dF"},
						{32,"К11 - поправка при F = Fmin + 10∙dF"},
						{33,"М - метод обработки (1- кус.ломаная)"},
						{34,"N-1 - число точек обраб. минус один,(Nmax = 11)"},
						{35,"Fmin - минимальная частота, Гц"},
						{36,"dF - шаг по частоте, Гц"},
						{37,"K1 - поправка при F = Fmin"},
						{38,"К2 - поправка при F = Fmin + dF"},
						{39,"К3 - поправка при F = Fmin + 2∙dF"},
						{40,"К4 - поправка при F = Fmin + 3∙ dF"},
						{41,"К5 - поправка при F = Fmin + 4∙dF"},
						{42,"К6 - поправка при F = Fmin + 5∙dF"},
						{43,"K7 - поправка при F = Fmin + 6∙dF"},
						{44,"К8 - поправка при F = Fmin + 7∙dF"},
						{45,"К9 - поправка при F = Fmin + 8∙ dF"},
						{46,"К10 - поправка при F = Fmin + 9∙dF"},
						{47,"К11 - поправка при F = Fmin + 10∙dF"},
						{48,"М - метод обработки (1- кус.ломаная)"},
						{49,"N-1 - число точек обраб. минус один,(Nmax = 11)"},
						{50,"Fmin - минимальная частота, Гц"},
						{51,"dF - шаг по частоте, Гц"},
						{52,"K1 - поправка при F = Fmin"},
						{53,"К2 - поправка при F = Fmin + dF"},
						{54,"К3 - поправка при F = Fmin + 2∙dF"},
						{55,"К4 - поправка при F = Fmin + 3∙ dF"},
						{56,"К5 - поправка при F = Fmin + 4∙dF"},
						{57,"К6 - поправка при F = Fmin + 5∙dF"},
						{58,"K7 - поправка при F = Fmin + 6∙dF"},
						{59,"К8 - поправка при F = Fmin + 7∙dF"},
						{60,"К9 - поправка при F = Fmin + 8∙ dF"},
						{61,"К10 - поправка при F = Fmin + 9∙dF"},
						{62,"К11 - поправка при F = Fmin + 10∙dF"}
					};
                case 0035:
                    return new Dictionary<int, string>()
					{
						{1,"tn - температура, °С"},
						{2,"Рir - давление, МПа"},
						{3,"Wn - обводненность нефти,%"},
						{4,"Ron - плотн. безвод. нефти (t=20 град).,т/.м³"},
						{5,"Квяз - коэффициент вязкости"},
						{6,"Vс - содержание солей в жидкости, %"},
						{7,"Vмех.пр. - содержание мех. примесей в жидкости, %"},
						{8,"Ксг - коэффициент содержания свободного. газа"},
						{9,"Крг - коэффициент содержания растворенного газа"},
						{10,"Кt н - коэффициент объемного расширения нефти"},
						{11,"Кt в - коэффициент объемного расширения воды"},
						{13,"F в- коэффициент сжимаемости воды, 1/МПа"},
						{14,"Fн - коэффициент сжимаемости нефти, 1/МПа"},
						{12,"Рбар - барометр. давление, мм.рт.ст."},
						{15,"Wt - порог переключ. влагомеров, %"},
						{18,"Qw1 lim - ограничение min расхода, м³/час"},
						{19,"Qw2 lim - ограничение min расхода, м³/час"},
						{20,"Qw1 lim - ограничение min расхода, м³/час"}
					};
                case 0036:
                    return new Dictionary<int, string>()
					{
						{1,"b - ширина порога водослива, м"},
						{2,"Р - высота порога водослива, м"}
					};
                case 0037:
                    return new Dictionary<int, string>()
					{
						{4,"Ro - плотность жидкости,кг/.м³"},
						{5,"G - ускорение свободного падения, м/ сек^2"},
						{6,"h0 - нулевой уровень, м"},
						{7,"S - площадь резервуара, м^2"}
					};
                case 0038:
                    return new Dictionary<int, string>()
					{
						{12,"Pбар - давление баром.,мм рт.ст."},
						{5,"Тхв-температура холодной воды"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Dryness - степень сухости нас. пара"}
					};
                case 0039:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.,кг/м³"},
						{1,"tnorm - нормальная температура"},
						{6,"С1 - коэффициент полинома"},
						{7,"С2 - коэффициент полинома"},
						{8,"C₃ - коэффициент полинома"},
						{9,"С4 - коэффициент полинома"},
						{10,"С5 - коэффициент полинома"},
						{18,"Метод обработки (1- кус.ломаная)"},
						{19,"N-1 - число точек обраб. минус один,(Nmax = 11)"},
						{20,"Fmin - минимальная частота, Гц"},
						{21,"dF - шаг по частоте, Гц"},
						{22,"K1 - поправка при F = Fmin"},
						{23,"К2 - поправка при F = Fmin + dF"},
						{24,"К3 - поправка при F = Fmin + 2∙dF"},
						{25,"К4 - поправка при F = Fmin + 3∙ dF"},
						{26,"К5 - поправка при F = Fmin + 4∙dF"},
						{27,"К6 - поправка при F = Fmin + 5∙dF"},
						{28,"K7 - поправка при F = Fmin + 6∙dF"},
						{29,"К8 - поправка при F = Fmin + 7∙dF"},
						{30,"К9 - поправка при F = Fmin + 8∙ dF"},
						{31,"К10 - поправка при F = Fmin + 9∙dF"},
						{32,"К11 - поправка при F = Fmin + 10∙dF"},
						{33,"Метод обработки (1- кус.ломаная)"},
						{34,"N-1 - число точек обраб. минус один,(Nmax = 11)"},
						{35,"Fmin - минимальная частота, Гц"},
						{36,"dF - шаг по частоте, Гц"},
						{37,"K1 - поправка при F = Fmin"},
						{38,"К2 - поправка при F = Fmin + dF"},
						{39,"К3 - поправка при F = Fmin + 2∙dF"},
						{40,"К4 - поправка при F = Fmin + 3∙ dF"},
						{41,"К5 - поправка при F = Fmin + 4∙dF"},
						{42,"К6 - поправка при F = Fmin + 5∙dF"},
						{43,"K7 - поправка при F = Fmin + 6∙dF"},
						{44,"К8 - поправка при F = Fmin + 7∙dF"},
						{45,"К9 - поправка при F = Fmin + 8∙ dF"},
						{46,"К10 - поправка при F = Fmin + 9∙dF"},
						{47,"К11 - поправка при F = Fmin + 10∙dF"}
					};
                case 0041:
                    return new Dictionary<int, string>()
					{
						{9,"Qt(Gm1;2)-расч. по прямой(0)/обр.(1)"},
						{5,"Тхв - температура холодной воды"}
					};
                case 0042:
                    return new Dictionary<int, string>()
					{
						{5,"Tхв - температура холодной воды"}
					};
                case 0049:
                    return new Dictionary<int, string>()
					{
						{12,"Pбар - давление барометрическое,мм р"},
						{5,"tхв - температура холодной воды"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"}
					};
                case 0050:
                    return new Dictionary<int, string>()
					{
						{2,"d20_1mm - диаметр входного трубопровода при 20 °С"},
						{10,"Kt_d1 - коэфф. расширения вх. трубопровода,1/град"},
						{3,"d20_2mm - диаметр выходного трубопровода при 20 °С"},
						{11,"Kt_d2 - коэфф. расширения вых. трубопровода,1/град"},
						{1,"Ср - уд.теплоемкость жидкости, дж/кг∙ град"},
						{5,"Kt_w - к-т температ. расширения жидкости,1/град"},
						{4,"Ro - плотность жидкости, кг/м³"}
					};
                case 0051:
                    return new Dictionary<int, string>()
					{
						{1,"Ср - уд.теплоемкость жидкости, дж/кг∙ град"},
						{4,"Ro - плотность жидкости, кг/м³"},
						{6,"A - коэфф.1 паспортной характеристики насоса"},
						{7,"В - коэфф.2 паспортной характеристики насоса"},
						{8,"Lf - механические потери, %"},
						{9,"Nnom - номинальная мощность эл. двигателя, кВт"},
						{11,"Q1"},
						{12,"Q2"},
						{13,"Q3"},
						{14,"Q4"},
						{15,"Q5"},
						{16,"Q6"}
					};
                case 0053:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр. на притупление вх. кромки"},
						{14,"Rш -абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fi - относительная влажность;%"},
						{23,"Метан (CH₄)"},
						{24,"Этан (C₂H₆)"},
						{25,"Пропан (C₃H₈)"},
						{26,"н-Бутан (n-C₄H₁₀)"},
						{27,"и-Бутан (i-C₄H₁₀)"},
						{28,"н-Пентан (n-C₅H₁₂)"},
						{29,"и-Пентан (i-C₅H₁₂)"},
						{30,"н-Гексан (n-C₆H₁₄)"},
						{31,"н-Гептан (n-C₇H16)"},
						{32,"н-Октан (n-C₈H₁₈)"},
						{33,"Ацетилен (C₂H₂)"},
						{34,"Этилен (C₂H₄)"},
						{35,"Пропилен (C₃H₄)"},
						{36,"Бензол (C₆H₆)"},
						{37,"Толуол (C₇H₈)"},
						{38,"Водород (H₂)"},
						{39,"Водяной пар (H₂О)"},
						{40,"Аммиак (H₃N)"},
						{41,"Метанол (CH₄O)"},
						{42,"Сероводород (H₂S)"},
						{43,"Метилмеркаптан (СH₄S)"},
						{44,"Диосид серы (SO₂)"},
						{45,"Гелий (Hе)"},
						{46,"Неон (Nе)"},
						{47,"Аргон (Ar)"},
						{48,"Моноксид углерода (CO)"},
						{6,"Азот (N₂)"},
						{49,"Кислород (О₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{1,"tr - расчетный час"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0055:
                    return new Dictionary<int, string>()
					{
						{5,"Tхв - температура холодной воды"}
					};
                case 0056:
                    return new Dictionary<int, string>()
					{
						{5,"Tхв - температура холодной воды"}
					};
                case 0059:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fi - относительная влажность;%"},
						{23,"Метан (CH₄)"},
						{24,"Этан (C₂H₆)"},
						{25,"Пропан (C₃H₈)"},
						{26,"н-Бутан (n-C₄H₁₀)"},
						{27,"и-Бутан (i-C₄H₁₀)"},
						{28,"н-Пентан (n-C₅H₁₂)"},
						{29,"и-Пентан (i-C₅H₁₂)"},
						{30,"н-Гексан (n-C₆H₁₄)"},
						{31,"н-Гептан (n-C₇H16)"},
						{32,"н-Октан (n-C₈H₁₈)"},
						{33,"Ацетилен (C₂H₂)"},
						{34,"Этилен (C₂H₄)"},
						{35,"Пропилен (C₃H₄)"},
						{36,"Бензол (C₆H₆)"},
						{37,"Толуол (C₇H₈)"},
						{38,"Водород (H₂)"},
						{39,"Водяной пар (H₂О)"},
						{40,"Аммиак (H₃N)"},
						{41,"Метанол (CH₄O)"},
						{42,"Сероводород (H₂S)"},
						{43,"Метилмеркаптан (СH₄S)"},
						{44,"Диосид серы (SO₂)"},
						{45,"Гелий (Hе)"},
						{46,"Неон (Nе)"},
						{47,"Аргон (Ar)"},
						{48,"Моноксид углерода (CO)"},
						{6,"Азот (N₂)"},
						{49,"Кислород (O₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{1,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0060:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафр. при 20 °С,мм"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диаметр трубопровода при 20 °С"},
						{11,"Kt_D- темп.коэфф.лин.расш. трубопр.,1/°С"},
						{13,"Кп - попр.на притупл. вх. кромки"},
						{14,"Rш -абс.экв.шероховатости, мм"},
						{15,"Тип dP(0-угл.,1-фл.,2-трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{4,"Ron - плотн.при норм.усл.,кг/м³"},
						{7,"fiw - влажность при раб.усл., %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{9,"(0-природн.)"},
						{17,"SW - подключить догов.парам. (1- да, 0- нет)"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0061:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр. на притупление вх. кромки"},
						{14,"Rш -абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{8,"Kappa- показатель адиабаты"},
						{7,"fiw - относительная влажность при раб.усл.; %"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{9,"1-возд,3-кислор,4- азот,5-аргон,6-CO₂"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{19,"dPmin - мин.рабочий перепад давл.,(% от dPmax)"}
					};
                case 0062:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафр. при 20 °С,мм"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диаметр трубопровода при 20 °С"},
						{11,"Kt_D- темп.коэфф.лин.расш. трубопр.,1/°С"},
						{13,"Кп - попр.на притупл. вх. кромки"},
						{14,"Rш -абс.экв.шероховатости, мм"},
						{15,"Тип dP(0-угл.,1-фл.,2-трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fi w - относительная влажность при раб.усл.; %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{9,"(0-природн.)"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{1,"Qn max - нормальный объмный расход, н.м³/час"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0063:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С, мм"},
						{10,"Kt_d- температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диаметр трубопров.при 20 °С, мм"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр. на притупление вх. кромки"},
						{14,"Rш -абс.эквив.шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{17,"SW -подключить договорн.парам.(1- да,0- нет)"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"},
						{21,"Рir - давление, единицы изм. из паспорта"},
						{22,"tn - температура, °С"},
						{4,"Ron - плотн.при норм.усл.,кг/м³"},
						{7,"fiw - относит. влажность при раб.усл.,%"},
						{23,"Метан (CH₄)"},
						{24,"Этан (C₂H₆)"},
						{25,"Пропан (C₃H₈)"},
						{26,"н-Бутан (n-C₄H₁₀)"},
						{27,"и-Бутан (i-C₄H₁₀)"},
						{28,"н-Пентан (n-C₅H₁₂)"},
						{29,"и-Пентан (i-C₅H₁₂)"},
						{30,"н-Гексан (n-C₆H₁₄)"},
						{31,"н-Гептан (n-C₇H16)"},
						{32,"н-Октан (n-C₈H₁₈)"},
						{33,"Ацетилен (C₂H₂)"},
						{34,"Пропилен (C₃H₄)"},
						{35,"Бензол (C₆H₆)"},
						{36,"Водород (H₂)"},
						{37,"Аммиак (H₃N)"},
						{38,"Метанол (CH₄O)"},
						{39,"Сероводород (H₂S)"},
						{40,"Метилмеркаптан (СH₄S)"},
						{41,"Диосид серы (SO₂)"},
						{16,"Гелий (Hе)"},
						{20,"Аргон (Ar)"},
						{9,"Моноксид углерода (CO)"},
						{6,"Азот (N₂)"},
						{8,"Кислород (O₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{1,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0065:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Kп - попр. на притупление вх. кромки"},
						{14,"Rш - абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{19,"dPmin - миним. перепад давл.в % от dPmax"},
						{9,"Плотномер(0), расчет(1)"},
						{50,"Ro0, кг/м³"},
						{51,"Ro1, кг/(м³∙град.)"},
						{52,"RO₂, кг/(м³∙град^2)"},
						{53,"Ro3, кг/(м³∙град^3)"},
						{4,"Ron - плотность при норм.усл.,кг/м³"},
						{1,"tnorm - нормальная температура"},
						{5,"Mu0, Па∙С"},
						{6,"Mu1, Па∙С/град"},
						{7,"Mu2, Па∙С/град^2"},
						{8,"Mu3, Па∙С/град^3"}
					};
                case 0066:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Kп - попр. на притупление вх. кромки"},
						{14,"Rш - абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{5,"Тхв-температура холодной воды"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"}
					};
                case 0067:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Kп - попр. на притупление вх. кромки"},
						{14,"Rш - абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{20,"d20mm - диаметр диафрагмы при 20 °С"},
						{22,"Kt_d - коэфф. расширения диафрагмы"},
						{21,"D20mm - диам. трубопровода при 20 °С"},
						{23,"Kt_D- коэфф. расш. трубопровода"},
						{24,"Kп - попр. на притупление вх. кромки"},
						{25,"Rш - абс. экв. шероховат., мм"},
						{26,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{27,"dCinf"},
						{28,"CQ1"},
						{29,"CQ2"},
						{30,"CQ3"},
						{31,"CQ4"},
						{32,"Remin"},
						{33,"QshA"},
						{34,"QshB"},
						{35,"QshC"},
						{9,"Qt(Gm1;2)-расчет Qt по пр-0/обр-1"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"}
					};
                case 0068:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/град"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Kп - попр. на притупление вх. кромки"},
						{14,"Rш - абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{20,"d20mm - диаметр диафрагмы при 20 °С"},
						{22,"Kt_d - коэфф. расширения диафрагмы"},
						{21,"D20mm - диам. трубопровода при 20 °С"},
						{23,"Kt_D- коэфф. расш. трубопровода"},
						{24,"Kп - попр. на притупление вх. кромки"},
						{25,"Rш - абс. экв. шероховат., мм"},
						{26,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{27,"dCinf"},
						{28,"CQ1"},
						{29,"CQ2"},
						{30,"CQ3"},
						{31,"CQ4"},
						{32,"Remin"},
						{33,"QshA"},
						{34,"QshB"},
						{35,"QshC"},
						{5,"Tхв - температура холодной воды"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"}
					};
                case 0070:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр.на притупление вх. кромки"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{15,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{12,"Pбар - давление барометрическое,мм р"},
						{5,"Тхв-температура холодной воды"},
						{19,"dPmin - мин.рабочий перепад давл.,(% от dPmax)"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Степень сухости нас. пара, (от 70% до 100%)"}
					};
                case 0071:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр.на притупление вх. кромки"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{15,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{20,"d20mm - диаметр диафрагмы при 20 °С"},
						{22,"Kt_d - коэфф. температ. расширения диафрагмы"},
						{21,"D20mm - диам. трубопровода при 20 °С"},
						{23,"Kt_D- коэфф. температ. расш. трубопровода"},
						{24,"Кп - попр.на притупление вх. кромки"},
						{25,"Rш - абс. экв. шерохова., мм"},
						{26,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{27,"dCinf"},
						{28,"CQ1"},
						{29,"CQ2"},
						{30,"CQ3"},
						{31,"CQ4"},
						{32,"Remin"},
						{33,"QshA"},
						{34,"QshB"},
						{35,"QshC"},
						{12,"Pбар - давление барометрическое,мм р"},
						{5,"Тхв-температура холодной воды"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Dryness - степень сухости нас. пара"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)."}
					};
                case 0072:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр.на притупление вх. кромки"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{15,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{12,"Pбар - давление барометрическое,мм р"},
						{5,"Тхв-температура холодной воды"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Dryness - степень сухости нас. пара"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"}
					};
                case 0074:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d- температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр.на притупление вх. кромки"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{15,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{18,"dCinf"},
						{42,"CQ1"},
						{43,"CQ2"},
						{44,"CQ3"},
						{45,"CQ4"},
						{46,"Remin"},
						{47,"QshA"},
						{48,"QshB"},
						{49,"QshC"},
						{12,"Pбар - давление барометрическое,мм р"},
						{5,"Тхв-температура холодной воды"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Степень сухости нас. пара, (от 70% до 100%)"}
					};
                case 0101:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Kп - попр. на притупление вх. кромки"},
						{14,"Rш - абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{19,"dPmin - миним. перепад давл.в % от dPmax"},
						{9,"Плотномер(0), расчет(1)"},
						{50,"Ro0, кг/м³"},
						{51,"Ro1, кг/(м³∙град.)"},
						{52,"RO₂, кг/(м³∙град^2)"},
						{53,"Ro3, кг/(м³∙град^3)"},
						{4,"Ron - плотность при норм.усл.,кг/м³"},
						{1,"tnorm - нормальная температура"},
						{5,"Mu0, Па∙С"},
						{6,"Mu1, Па∙С/град"},
						{7,"Mu2, Па∙С/град^2"},
						{8,"Mu3, Па∙С/град^3"}
					};
                case 0102:
                    return new Dictionary<int, string>()
					{
						{9,"Плотномер(0), расчет(1)"},
						{50,"Ro0, кг/м³"},
						{51,"Ro1, кг/(м³∙град.)"},
						{52,"RO₂, кг/(м³∙град^2)"},
						{53,"Ro3, кг/(м³∙град^3)"},
						{4,"Ron - плотность при норм.усл.,кг/м³"},
						{1,"tnorm - нормальная температура"}
					};
                case 0103:
                    return new Dictionary<int, string>()
					{
						{18,"Тип ИУ (СУ - 0, СУТ - 1)"},
						{2,"d20mm - диаметр диафр. при 20 °С,мм"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам.тр.(ССУ) или ИТ(СУТ) при 20 °С"},
						{11,"Kt_D- темп.коэфф.лин.расш.тр.(ССУ) или ИТ(СУТ)"},
						{13,"Кп - попр.на притупл.вх.кромки(ССУ)"},
						{14,"Rш -абс.экв.шероховат.(ССУ), мм"},
						{15,"Тип dP(0-угл.,1-фл.,2-трехр.)(ССУ)"},
						{16,"Отбор низк.давл.для СУТ(на ИТ-0, на СУТ-1)"},
						{20,"alpha - коэфф. преобразования СУТ"},
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{8,"Kappa- показатель адиабаты"},
						{7,"fi - влажность в н.у., %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{17,"SW - подключить догов.парам. (1 - да, 0 - нет)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{9,"(0-природн.)"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0104:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Kп - попр. на притупление вх. кромки"},
						{14,"Rш - абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{5,"Тхв-температура холодной воды"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"}
					};
                case 0105:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр.на притупление вх. кромки"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{15,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{12,"Pбар - давление барометрическое,мм р"},
						{5,"Тхв-температура холодной воды"},
						{19,"dPmin - мин.рабочий перепад давл.,(% от dPmax)"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Степень сухости нас. пара, (от 70% до 100%)"}
					};
                case 0106:
                    return new Dictionary<int, string>()
					{
						{12,"Pбар - давление барометрическое,мм р"},
						{5,"Тхв-температура холодной воды"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"}
					};
                case 0107:
                    return new Dictionary<int, string>()
					{
						{ 2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{ 3,"D20mm - диам. трубопровода при 20 °С "},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр.на притупление вх. кромки"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{15,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{12,"Pбар - давление барометрическое,мм р"},
						{ 5,"Тхв-температура холодной воды"},
						{19,"dPmin - мин.рабочий перепад давл.,(% от dPmax)"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Степень сухости нас. пара, (от 70% до 100%)"}
					};
                case 0108:
                    return new Dictionary<int, string>()
					{
						{ 2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{ 3,"D20mm - диам. трубопровода при 20 °С "},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр.на притупление вх. кромки"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{15,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{34,"d20mm - диаметр диафрагмы при 20 °С"},
						{42,"Kt_d - коэфф. температ. расширения диафрагмы"},
						{35,"D20mm - диам. трубопровода при 20 °С "},
						{43,"Kt_D- коэфф. температ. расш. трубопровода"},
						{45,"Кп - попр.на притупление вх. кромки"},
						{46,"Rш - абс. экв. шерохова., мм"},
						{47,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{12,"Pбар - давление барометрическое,мм р"},
						{ 5,"Тхв-температура холодной воды"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Dryness - степень сухости нас. пара"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)."}
					};
                case 0110:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С "},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Kп - попр. на притупление вх. кромки"},
						{14,"Rш - абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{34,"d20mm - диаметр диафрагмы при 20 °С"},
						{42,"Kt_d - коэфф. расширения диафрагмы"},
						{35,"D20mm - диам. трубопровода при 20 °С "},
						{43,"Kt_D- коэфф. расш. трубопровода"},
						{45,"Kп - попр. на притупление вх. кромки"},
						{46,"Rш - абс. экв. шероховат., мм"},
						{47,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{ 9,"Qt(Gm1;2)-расчет Qt по пр-0/обр-1"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"}
					};
                case 0111:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/град"},
						{3,"D20mm - диам. трубопровода при 20 °С "},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Kп - попр. на притупление вх. кромки"},
						{14,"Rш - абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{34,"d20mm - диаметр диафрагмы при 20 °С"},
						{42,"Kt_d - коэфф. расширения диафрагмы"},
						{35,"D20mm - диам. трубопровода при 20 °С "},
						{43,"Kt_D- коэфф. расш. трубопровода"},
						{45,"Kп - попр. на притупление вх. кромки"},
						{46,"Rш - абс. экв. шероховат., мм"},
						{47,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{5,"Tхв - температура холодной воды"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"}
					};
                case 0113:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр. на притупление вх. кромки"},
						{14,"Rш - абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{8,"Kappa- показатель адиабаты"},
						{7,"fi - влажность при н.у.;%"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{9,"1-возд,3-кислор,4- азот,5-аргон,6-CO₂"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{19,"dPmin - мин.рабочий перепад давл.,(% от dPmax)"}
					};
                case 0114:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр. на притупление вх. кромки"},
						{14,"Rш -абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{8,"Kappa- показатель адиабаты"},
						{7,"fi - относительная влажность при н.у.;%"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{1,"tw - интервал ожидания додувки, мин"},
						{19,"dPmin - мин.рабочий перепад давл.,(% от dPmax)"}
					};
                case 0116:
                    return new Dictionary<int, string>()
					{
						{ 2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{ 3,"D20mm - диам. трубопровода при 20 °С "},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр.на притупление вх. кромки"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{15,"Тип_dP (0 - угл.,1 - фл., 2 - трехр.)"},
						{12,"Pбар - давление барометрическое,мм р"},
						{ 5,"Тхв-температура холодной вод"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Dryness - степень сухости нас. пара"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"}
					};
                case 0117:
                    return new Dictionary<int, string>()
					{
						{2,"d - диаметр сужающего устройства при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш. СУ,1/°С"},
						{3,"D - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{18,"Тип СУ"},
						{12,"Pбар - давление барометрическое,мм р"},
						{5,"Тхв-температура холодной воды"},
						{19,"dPmin - мин.рабочий перепад давл.,(% от dPmax)"},
						{17,"Тип пара (0 - перегретый, 1 - насыщенный)"},
						{16,"Степень сухости нас. пара, (от 70% до 100%)"}
					};
                case 0118:
                    return new Dictionary<int, string>()
					{
						{7,"fi - относительная влажность;%"},
						{9,"1 - возд.,3 - кисл.,4 - азот,5 - аргон,6-CO₂"},
						{17,"SW - подключить догов.парам.(1 - да, 0 - нет)."},
						{13,"Qo1 - расход объмный, м³/час"},
						{14,"QO2 - расход объмный, м³/час"},
						{15,"Qo3 - расход объмный, м³/час"},
						{16,"Qo4 - расход объмный, м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"}
					};
                case 0119:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fi - относительная влажность;%"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{9,"Природный газ"},
						{17,"SW - подключить догов.парам.(1 - да, 0 - нет)."},
						{13,"Qo1 - расход объмный, м³/час"},
						{14,"QO2 - расход объмный, м³/час"},
						{15,"Qo3 - расход объмный, м³/час"},
						{16,"Qo4 - расход объмный, м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0120:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fi - относительная влажность;%"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{9,"Природный (0)"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{13,"Qo1 - объемный расход (узел 1), м³/час"},
						{14,"QO2 - объемный расход (узел 2), м³/час"},
						{21,"Рir - давление, единицы изм. из паспорта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0121:
                    return new Dictionary<int, string>()
					{
						{7,"fi - относительная влажность;%"},
						{9,"1- возд.,3- кисл.,4- азот,5- аргон,6- СO₂"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{13,"Qo1 - объемный расход (узел 1), м³/час"},
						{14,"QO2 - объемный расход (узел 2), м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"}
					};
                case 0140:
                    return new Dictionary<int, string>()
					{
						{ 2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{ 3,"D20mm - диам. трубопровода при 20 °С "},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр. на притупление вх. кромки"},
						{14,"Rш -абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{ 4,"Ron - плотн.при норм.усл.;кг/м³ "},
						{ 8,"Kappa- показатель адиабаты"},
						{ 7,"fi - относительная влажность;%"},
						{ 12,"Pбар - Барометр. давление, мм рт.ст."},
						{32,"tacc - время усреднения,сек"}
					};
                case 0147:
                    return new Dictionary<int, string>()
					{
						{2,"d - диаметр сужающего устройства при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш. СУ,1/°С"},
						{3,"D - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{14,"Rш - абс. экв. шерохова., мм"},
						{18,"Тип СУ"},
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{8,"Kappa- показатель адиабаты"},
						{7,"fiw1 - относит. влажность при раб.усл.(узел1), %"},
						{12,"Pбар - давление барометрическое,мм р"},
						{19,"dPmin - мин.рабочий перепад давл.,(% от dPmax)"},
						{32,"tacc - время усреднения,сек"}
					};
                case 0153:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С, мм"},
						{10,"Kt_d- температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диаметр трубопров.при 20 °С, мм"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр. на притупление вх. кромки"},
						{14,"Rш -абс.эквив.шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{17,"SW -подключить договорн.парам.(1- да,0- нет)"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"},
						{21,"Рir - давление, единицы изм. из паспорта"},
						{22,"tn - температура, °С"},
						{4,"Ron - плотн.при норм.усл.,кг/м³"},
						{7,"fiw - относит. влажность при раб.усл.,%"},
						{23,"Метан (CH₄)"},
						{24,"Этан (C₂H₆)"},
						{25,"Пропан (C₃H₈)"},
						{26,"н-Бутан (n-C₄H₁₀)"},
						{27,"и-Бутан (i-C₄H₁₀)"},
						{28,"н-Пентан (n-C₅H₁₂)"},
						{29,"и-Пентан (i-C₅H₁₂)"},
						{30,"н-Гексан (n-C₆H₁₄)"},
						{31,"н-Гептан (n-C₇H16)"},
						{32,"н-Октан (n-C₈H₁₈)"},
						{33,"Ацетилен (C₂H₂)"},
						{34,"Этилен (C₂H₄)"},
						{35,"Пропилен (C₃H₄)"},
						{36,"Бензол (C₆H₆)"},
						{37,"Толуол (C₇H₈)"},
						{38,"Водород (H₂)"},
						{39,"Водяной пар (H₂О)"},
						{40,"Аммиак (H₃N)"},
						{41,"Метанол (CH₄O)"},
						{42,"Сероводород (H₂S)"},
						{43,"Метилмеркаптан (СH₄S)"},
						{44,"Диосид серы (SO₂)"},
						{45,"Гелий (Hе)"},
						{46,"Неон (Nе)"},
						{47,"Аргон (Ar)"},
						{48,"Моноксид углерода (CO)"},
						{6,"Азот (N₂)"},
						{49,"Кислород (O₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{1,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0159:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fiw - относит. влажность при раб.усл.,%"},
						{23,"Метан (CH₄)"},
						{24,"Этан (C₂H₆)"},
						{25,"Пропан (C₃H₈)"},
						{26,"н-Бутан (n-C₄H₁₀)"},
						{27,"и-Бутан (i-C₄H₁₀)"},
						{28,"н-Пентан (n-C₅H₁₂)"},
						{29,"и-Пентан (i-C₅H₁₂)"},
						{30,"н-Гексан (n-C₆H₁₄)"},
						{31,"н-Гептан (n-C₇H16)"},
						{32,"н-Октан (n-C₈H₁₈)"},
						{33,"Ацетилен (C₂H₂)"},
						{34,"Этилен (C₂H₄)"},
						{35,"Пропилен (C₃H₄)"},
						{36,"Бензол (C₆H₆)"},
						{37,"Толуол (C₇H₈)"},
						{38,"Водород (H₂)"},
						{39,"Водяной пар (H₂О)"},
						{40,"Аммиак (H₃N)"},
						{41,"Метанол (CH₄O)"},
						{42,"Сероводород (H₂S)"},
						{43,"Метилмеркаптан (СH₄S)"},
						{44,"Диосид серы (SO₂)"},
						{45,"Гелий (Hе)"},
						{46,"Неон (Nе)"},
						{47,"Аргон (Ar)"},
						{48,"Моноксид углерода (CO)"},
						{6,"Азот (N₂)"},
						{49,"Кислород (O₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{17,"SW -подключить договорн.парам.(1- да,0- нет)"},
						{13,"Qo1 - расход объмный, м³/час"},
						{14,"QO2 - расход объмный, м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{1,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0202:
                    return new Dictionary<int, string>()
					{
						{18,"ТИП ССУ"},
						{2,"d20mm - диаметр диафр. при 20 °С,мм"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам.тр.(ССУ) или ИТ(СУТ) при 20 °С"},
						{11,"Kt_D- темп.коэфф.лин.расш.трубопровода, 1/°С"},
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{8,"Kappa- показатель адиабаты"},
						{7,"fiw - влажность при раб.усл.; %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{9,"(0-природн.)"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0203:
                    return new Dictionary<int, string>()
					{
						{18,"Тип ИУ (СУ - 0, СУТ - 1)"},
						{2,"d20mm - диаметр диафр. при 20 °С,мм"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам.тр.(ССУ) или ИТ(СУТ) при 20 °С"},
						{11,"Kt_D- темп.коэфф.лин.расш.тр.(ССУ) или ИТ(СУТ)"},
						{13,"Кп - попр.на притупл.вх.кромки(ССУ)"},
						{14,"Rш -абс.экв.шероховат.(ССУ), мм"},
						{15,"Тип dP(0-угл.,1-фл.,2-трехр.)(ССУ)"},
						{16,"Отбор низк.давл.для СУТ(на ИТ-0, на СУТ-1)"},
						{20,"alpha - коэфф. преобразования СУТ"},
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{8,"Kappa- показатель адиабаты"},
						{7,"fi w - относительная влажность при раб.усл.; %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{19,"dPmin - min рабочий перепад давл.,(% от dPmax)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{9,"(0-природн.)"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0204:
                    return new Dictionary<int, string>()
					{
						{2,"d20 - диаметр тела обтекания, м"},
						{3,"D20 - диаметр проходного сечения ПП, м"},
						{11,"alpha - коэфф. линейного расширения ПП, 1/ °С"},
						{10,"Muf - кофф. сужения потока"},
						{20,"Ksi - коэфф. приведения давления"},
						{15,"Kqn АМ - поправ. коэфф. на вязкость в усл. АМ"},
						{16,"Fcb20 - площадь сечения ПП при 20 °С, кв.м"},
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{8,"Kappa- показатель адиабаты"},
						{18,"R/m - удельная газовая постоянная, Дж/(кг∙К)"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{13,"Qo1 - расход, м³/час"},
						{21,"Рir - давление, единицы изм. из паспoрта"},
						{22,"tn - температура, °С"},
						{9,"(0-природн.)"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{30,"Ref1 - модифицир. число Рейнольдса"},
						{31,"Kqn1 - поправ. коэфф. на вязкость"},
						{32,"Ref2 - модифицир. число Рейнольдса"},
						{33,"KqN₂ - поправ. коэфф. на вязкость"},
						{34,"Ref3 - модифицир. число Рейнольдса"},
						{35,"Kqn3 - поправ. коэфф. на вязкость"},
						{36,"Ref4 - модифицир. число Рейнольдса"},
						{37,"Kqn4 - поправ. коэфф. на вязкость"},
						{38,"Ref5 - модифицир. число Рейнольдса"},
						{39,"Kqn5 - поправ. коэфф. на вязкость"},
						{40,"Ref6 - модифицир. число Рейнольдса"},
						{41,"Kqn6 - поправ. коэфф. на вязкость"},
						{42,"Ref7 - модифицир. число Рейнольдса"},
						{43,"Kqn7 - поправ. коэфф. на вязкость"},
						{44,"Ref8 - модифицир. число Рейнольдса"},
						{45,"Kqn8 - поправ. коэфф. на вязкость"},
						{46,"Ref9 - модифицир. число Рейнольдса"},
						{47,"Kqn9 - поправ. коэфф. на вязкость"},
						{48,"Ref10 - модифицир. число Рейнольдса"},
						{49,"Kqn10 - поправ. коэфф. на вязкость"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0205:
                    return new Dictionary<int, string>()
					{
						{2,"d20 - диаметр тела обтекания, м"},
						{3,"D20 - диаметр проходного сечения ПП, м"},
						{11,"alpha - коэфф. линейного расширения ПП, 1/°С"},
						{10,"Muf - кофф. сужения потока"},
						{20,"Ksi - коэфф. приведения давления"},
						{7,"Kqn АМ - поправ. коэфф. на вязкость в усл. АМ"},
						{19,"Fcb20 - площадь сечения ПП при 20°С, кв.м"},
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{8,"Kappa- показатель адиабаты"},
						{18,"R/m - удельная газовая постоянная, Дж/(кг∙К)"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{16,"Group - значение"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{13,"Qo min - расход объмный, м³/час"},
						{14,"Qo max - расход объмный, м³/час"},
						{15,"Qn max - нормальный объмный расход, н.м³/час"},
						{21,"Рir - давление, единицы изм. из паспoрта"},
						{22,"tn - температура, °С"},
						{9,"(0-природн.)"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{30,"Ref1 - модифицир. число Рейнольдса"},
						{31,"Kqn1 - поправ. коэфф. на вязкость"},
						{32,"Ref2 - модифицир. число Рейнольдса"},
						{33,"KqN₂ - поправ. коэфф. на вязкость"},
						{34,"Ref3 - модифицир. число Рейнольдса"},
						{35,"Kqn3 - поправ. коэфф. на вязкость"},
						{36,"Ref4 - модифицир. число Рейнольдса"},
						{37,"Kqn4 - поправ. коэфф. на вязкость"},
						{38,"Ref5 - модифицир. число Рейнольдса"},
						{39,"Kqn5 - поправ. коэфф. на вязкость"},
						{40,"Ref6 - модифицир. число Рейнольдса"},
						{41,"Kqn6 - поправ. коэфф. на вязкость"},
						{42,"Ref7 - модифицир. число Рейнольдса"},
						{43,"Kqn7 - поправ. коэфф. на вязкость"},
						{44,"Ref8 - модифицир. число Рейнольдса"},
						{45,"Kqn8 - поправ. коэфф. на вязкость"},
						{46,"Ref9 - модифицир. число Рейнольдса"},
						{47,"Kqn9 - поправ. коэфф. на вязкость"},
						{48,"Ref10 - модифицир. число Рейнольдса"},
						{49,"Kqn10 - поправ. коэфф. на вязкость"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0213:
                    return new Dictionary<int, string>()
					{
						{2,"d20mm - диаметр диафрагмы при 20 °С"},
						{10,"Kt_d - температ.коэфф.лин.расш.диафр.,1/°С"},
						{3,"D20mm - диам. трубопровода при 20 °С"},
						{11,"Kt_D- температ.коэфф.лин.расш.труб.,1/°С"},
						{13,"Кп - попр. на притупление вх. кромки"},
						{14,"Rш -абс. экв. шероховат., мм"},
						{15,"Тип dP (0 - угл., 1 - фл., 2 - трехр.)"},
						{8,"Kappa- показатель адиабаты"},
						{7,"fiw - влажность при раб.усл., %"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{9,"1-возд, 3-кислор, 4- азот, 5-аргон, 6-CO₂"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{19,"dPmin - мин.рабочий перепад давл.,(% от dPmax)"}
					};
                case 0216:
                    return new Dictionary<int, string>()
					{
						{7,"fiw - относительная влажность при раб.усл.; %"},
						{9,"1 - возд.,3 - кисл.,4 - азот,5 - аргон,6-CO₂"},
						{17,"SW - подключить догов.парам.(1 - да, 0 - нет)."},
						{13,"Qo1 - расход объмный, м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"}
					};
                case 0217:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fiw - относительная влажность при раб.усл; %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{9,"Природный газ"},
						{17,"SW - подключить догов.парам.(1 - да, 0 - нет)."},
						{13,"Qo1 - расход объмный, м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0218:
                    return new Dictionary<int, string>()
					{
						{7,"fiw - относительная влажность при раб.усл.; %"},
						{9,"1 - возд.,3 - кисл.,4 - азот,5 - аргон,6-CO₂"},
						{17,"SW - подключить догов.парам.(1 - да, 0 - нет)."},
						{13,"Qo1 - расход объмный, м³/час"},
						{14,"QO2 - расход объмный, м³/час"},
						{15,"Qo3 - расход объмный, м³/час"},
						{16,"Qo4 - расход объмный, м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"}
					};
                case 0219:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fiw - относительная влажность при раб.усл.; %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{9,"Природный газ"},
						{17,"SW - подключить догов.парам.(1 - да, 0 - нет)."},
						{13,"Qo1 - расход объмный, м³/час"},
						{14,"QO2 - расход объмный, м³/час"},
						{15,"Qo3 - расход объмный, м³/час"},
						{16,"Qo4 - расход объмный, м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0220:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fiw1 - относит. влажность при раб.усл.(узел1), %"},
						{8,"fiw2 - относит. влажность при раб.усл.(узул2), %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{9,"Природный (0)"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{13,"Qo1 - объемный расход (узел 1), м³/час"},
						{14,"QO2 - объемный расход (узел 2), м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0221:
                    return new Dictionary<int, string>()
					{
						{7,"fiw1 - относит. влажность при раб.усл.(узел1), %"},
						{8,"fiw2 - относит. влажность при раб.усл.(узел1), %"},
						{9,"1- возд.,3- кисл.,4- азот,5- аргон,6- СO₂"},
						{17,"SW - подключить догов.парам. (1- да, 0 - нет)"},
						{13,"Qo1 - объемный расход (узел 1), м³/час"},
						{14,"QO2 - объемный расход (узел 2), м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"}
					};
                case 0228:
                    return new Dictionary<int, string>()
					{
						{7,"fiw - относительная влажность при раб.усл.; %"},
						{9,"1 - возд.,3 - кисл.,4 - азот,5 - аргон,6-CO₂"},
						{17,"SW - подключить догов.парам.(1 - да, 0 - нет)."},
						{13,"Qo1 - расход объмный, м³/час"},
						{14,"QO2 - расход объмный, м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"}
					};
                case 0229:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fiw - относительная влажность при раб.усл.; %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{9,"Природный газ"},
						{17,"SW - подключить догов.парам.(1 - да, 0 - нет)."},
						{13,"Qo1 - расход объмный, м³/час"},
						{14,"QO2 - расход объмный, м³/час"},
						{21,"Рir - давление, единицы изм. из паспарта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                case 0230:
                    return new Dictionary<int, string>()
					{
						{4,"Ron - плотн.при норм.усл.;кг/м³"},
						{7,"fiw - относительная влажность при раб.усл.; %"},
						{24,"Метан (CH₄)"},
						{25,"Этан (C₂H₆)"},
						{26,"Пропан (C₃H₈)"},
						{27,"н-Бутан (n-C₄H₁₀)"},
						{28,"и-Бутан (i-C₄H₁₀)"},
						{6,"Азот (N₂)"},
						{5,"Диоксид углерода (CO₂)"},
						{29,"Сероводород (H₂S)"},
						{9,"Природный газ"},
						{16,"Group - значение"},
						{17,"SW - подключить догов.парам.(1 - да, 0 - нет)."},
						{13,"Qo min - расход объмный, м³/час"},
						{14,"Qo max - расход объмный, м³/час"},
						{15,"Qn max - нормальный объмный расход, н.м³/час"},
						{21,"Рir - давление, единицы изм. из паспорта"},
						{22,"tn - температура, °С"},
						{12,"Pбар - Барометр. давление, мм рт.ст."},
						{23,"tr - расчетный час"},
						{50,"P0"},
						{51,"T0"},
						{52,"Q(1,1)"},
						{53,"Q(1,2)"},
						{54,"Q(1,3)"},
						{55,"Q(2,1)"},
						{56,"Q(2,2)"},
						{57,"Q(2,3)"},
						{58,"Q(3,1)"},
						{59,"Q(3,2)"},
						{60,"Q(3,3)"},
						{61,"Q(4,1)"},
						{62,"Q(4,2)"},
						{63,"Q(4,3)"}
					};
                default:
                    log(string.Format("задача {0} не реализована", task));
                    return new Dictionary<int, string>() { };
            }
        }
    }
}
